app/controllers/exams_controller.rb

  def index
    @exams = Exam.all
---
SELECT "exams".* FROM "exams"

  def create
    @exam = Exam.new(exam_params)

    respond_to do |format|
      if @exam.save
---
INSERT INTO "exams" ("date", "title", "coefficient", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["date", "2024-02-22 10:06:00"], ["title", "Dissertation"], ["coefficient", 0.5], ["subject_id", 1], ["created_at", "2024-02-08 09:06:25.348957"], ["updated_at", "2024-02-08 09:06:25.348957"]]

    def set_exam
      @exam = Exam.find(params[:id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]