app/controllers/localities_controller.rb

  def index
    @localities = Locality.all
---
SELECT "localities".* FROM "localities"