app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("subject", "coefficient", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["subject", "Français"], ["coefficient", 1.0], ["status", "active"], ["created_at", "2024-02-08 09:05:52.847948"], ["updated_at", "2024-02-08 09:05:52.847948"]]